# **Librerias**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3

# **Configurando la DB**

In [5]:
con = sqlite3.connect('sql-murder-mystery.db')

In [6]:
# Ref: https://stackoverflow.com/questions/305378/list-of-tables-db-schema-dump-etc-using-the-python-sqlite3-api
# SELECT name FROM sqlite_master WHERE type='table'
cursor = con.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
for table in cursor.fetchall():
    print(table)

('crime_scene_report',)
('drivers_license',)
('person',)
('facebook_event_checkin',)
('interview',)
('get_fit_now_member',)
('get_fit_now_check_in',)
('income',)
('solution',)

In [4]:
query = "SELECT * FROM person"
pd.read_sql(query, con)

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684
...,...,...,...,...,...,...
10006,99936,Luba Benser,274427,680,Carnage Blvd,685095054
10007,99941,Roxana Mckimley,975942,1613,Gate St,512136801
10008,99965,Cherie Zeimantz,287627,3661,The Water Ave,362877324
10009,99982,Allen Cruse,251350,3126,N Jean Dr,348734531
10010,99990,Vance Hunten,830407,3056,Lancefield St,896677562

# **Investigacion**
Crimen ocurrió el 15 de enero del 2018 en SQL City (ASESINATO)

## Primera parte: Encontrando al **ASESINO**

In [43]:
query = "SELECT * FROM crime_scene_report WHERE date = 20180115 AND type = 'murder' AND city = 'SQL City'"
pd.read_sql(query, con)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [59]:
query = """SELECT
                * 
           FROM 
               crime_scene_report 
           WHERE date = 20180115 
           AND type = 'murder'
           AND city = 'SQL City'
"""
print(pd.read_sql(query, con)["description"][0])

Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".

Dos witnesses:
- Vive en la **ultima** casa en **"Northwestern Dr"**
- Su nombre es **Annabel**, vive en algun lugar de **"Franklin Ave"**

In [94]:
query = """SELECT * 
           FROM person
           WHERE address_street_name IN ('Northwestern Dr')
           ORDER BY address_number DESC
           LIMIT 10
"""
pd.read_sql(query, con)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949
1,17729,Lasonya Wildey,439686,3824,Northwestern Dr,917817122
2,53890,Sophie Tiberio,957671,3755,Northwestern Dr,442830147
3,73368,Torie Thalmann,773862,3697,Northwestern Dr,341559436
4,96595,Coretta Cubie,303645,3631,Northwestern Dr,378403829
5,19420,Cody Schiel,890431,3524,Northwestern Dr,947110049
6,93509,Emmitt Aceuedo,916706,3491,Northwestern Dr,979073160
7,87456,Leonora Wolfsberger,215868,3483,Northwestern Dr,565203106
8,36378,Freddie Ellzey,267882,3449,Northwestern Dr,474117596
9,53076,Boris Bijou,664914,3327,Northwestern Dr,401191868

**Primer Witness:**
- **id:** 14887
- **Nombre:** Morty Schapiro
- **licencse_id:** 118009
- **address_number:** 4919
- **address_street_name:** Northwestern Dr
- **ssn:** 111564949

In [84]:
query = """SELECT * 
           FROM person
           WHERE address_street_name IN ('Franklin Ave')
               AND name LIKE 'Annabel%'
"""
pd.read_sql(query, con)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

**Segundo Witness:**
- **id:** 16371
- **Nombre:** Annabel Miller
- **licencse_id:** 490173
- **address_number:** 103
- **address_street_name:** Franklin Ave
- **ssn:** 318771143

In [127]:
query = """SELECT *
           FROM interview
           WHERE person_id = 16371
               OR person_id = 14887
"""
print("TRANSCRIPTS DE WITNESSES:","\n")
print("MORTY:",pd.read_sql(query, con)["transcript"][0],"\n")
print("ANNABEL:",pd.read_sql(query, con)["transcript"][1],"\n")

TRANSCRIPTS DE WITNESSES:

MORTY: I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".

ANNABEL: I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.

In [103]:
query = """SELECT * 
           FROM get_fit_now_member AS members
           JOIN (SELECT membership_id 
                      FROM get_fit_now_check_in
                      WHERE check_in_date = 20180109) as check_in
                ON members.id = check_in.membership_id
           WHERE membership_status = 'gold'
               AND id LIKE '48Z%'

"""
pd.read_sql(query, con)

,id,person_id,name,membership_start_date,membership_status,membership_id
0,48Z7A,28819,Joe Germuska,20160305,gold,48Z7A
1,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55

Dos sospechosos:
- **Joe Germuska**
- **Jeremy Bowers**

In [122]:
query = """SELECT *
           FROM person
           JOIN (SELECT * 
                 FROM drivers_license
                WHERE plate_number LIKE  '%H42W%')  AS drivers
           ON person.license_id = drivers.id
           WHERE name IN ('Joe Germuska','Jeremy Bowers') 

"""

pd.read_sql(query, con)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

**Jeremy Bowers** es el **asesino**

## Segunda parte: Encontrando al **CULPABLE**

In [7]:
query = """SELECT *
           FROM interview
           WHERE person_id = 67318
"""
print("TRANSCRIPT del ASESINO:","\n")
print(pd.read_sql(query, con)["transcript"][0])

TRANSCRIPT del ASESINO:

I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.

In [19]:
query = """SELECT *
           FROM drivers_license
           WHERE car_make LIKE '%Tesla%' 
               AND car_model LIKE 'Model S'
               AND hair_color = 'red'
               AND height BETWEEN 65 AND 67
"""
pd.read_sql(query, con)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,202298,68,66,green,red,female,500123,Tesla,Model S
1,291182,65,66,blue,red,female,08CM64,Tesla,Model S
2,918773,48,65,black,red,female,917UU3,Tesla,Model S

In [35]:
query = """SELECT person_id,COUNT() as count
           FROM (SELECT *
                FROM facebook_event_checkin
                WHERE date BETWEEN 20171201 AND 20171231
                   AND event_name LIKE '%SQL%') AS sub
           GROUP BY person_id
           HAVING count = 3
"""
pd.read_sql(query, con)

   person_id  count
0      24556      3
1      99716      3

In [33]:
query = """SELECT *
           FROM person
           JOIN (SELECT *
                 FROM drivers_license
                 WHERE car_make LIKE '%Tesla%' 
                     AND car_model LIKE 'Model S'
                     AND hair_color = 'red'
                     AND height BETWEEN 65 AND 67) AS sub1
            ON person.license_id = sub1.id
            JOIN (SELECT person_id,COUNT() as count
                  FROM (SELECT *
                        FROM facebook_event_checkin
                        WHERE date BETWEEN 20171201 AND 20171231
                           AND event_name LIKE '%SQL%') AS innersub
                        GROUP BY person_id
                        HAVING count = 3) as sub2
            ON person.id = sub2.person_id
"""
pd.read_sql(query, con)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model,person_id,count
0,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,202298,68,66,green,red,female,500123,Tesla,Model S,99716,3

# **Validando Respuesta**

In [34]:
cursor = con.cursor() 
sql = "INSERT INTO solution VALUES (1, 'Miranda Priestly')"
cursor.execute(sql)
con.commit() 

var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

'Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!'